package bel.dmitrui98.timetable.util.enums.timetable;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * Тип часа в расписании (две недели, числитель, знаменатель, половина пары...)
 * Порядок следования должен совпадать с контекстным меню {@link bel.dmitrui98.timetable.control.TimetableContextMenu}
 */
@Getter
@AllArgsConstructor
public enum HourTypeEnum {

    /**
     * Две недели
     */
    TWO_WEEKS(2, "две недели", "2 нед", "две недели"),
    /**
     * Числитель
     */
    NUMERATOR(1, "числитель", "числ", "числитель"),
    /**
     * Знаменатель
     */
    DENOMINATOR(1, "знаменатель", "знам", "знаменатель"),

    /**
     * Две недели первая половина пары
     */
    WEEK_HALF_BEGIN(1, "2 недели полпары", "2 нед 1/2 нач", "две недели начало 1/2 пары"),
    /**
     * Две недели вторая половина пары
     */
    WEEK_HALF_END(1, "2 недели полпары", "2 нед 1/2 кон", "две недели конец 1/2 пары"),

    /**
     * Числитель первая половина пары
     */
    NUM_HALF_BEGIN(0.5, "числитель полпары", "числ 1/2 нач", "числитель начало 1/2 пары"),
    /**
     * Числитель вторая половина пары
     */
    NUM_HALF_END(0.5, "числитель полпары", "числ 1/2 кон", "числитель конец 1/2 пары"),

    /**
     * Знаменатель первая половина пары
     */
    DEN_HALF_BEGIN(0.5, "знаменатель полпары", "знам 1/2 нач", "знаменатель начало 1/2 пары"),
    /**
     * Знаменатель вторая половина пары
     */
    DEN_HALF_END(0.5, "знаменатель полпары", "знам 1/2 кон", "знаменатель конец 1/2 пары"),
    ;

    /**
     * Количество часов, которое будет добавляться или вычитаться из нагрузки
     */
    private double hour;
    private String contextMenuName;
    private String shortName;
    private String name;
}
